-- -*- M2-comint -*- hash: 15868280

i1 : R = ZZ/3[x,y]

o1 = R

o1 : PolynomialRing

i2 : I = ideal(x*(x-1)*(x-2)*y*(y-1)*(y-2)+1)

            3 3    3       3
o2 = ideal(x y  - x y - x*y  + x*y + 1)

o2 : Ideal of R

i3 : J = getMaxIdeal I

             2
o3 = ideal (x  + 1, - x + y)

o3 : Ideal of R

i4 : isSubset(I,J)

o4 = true

i5 : codim J

o5 = 2

i6 : P = minimalPrimes J

              2
o6 = {ideal (x  + 1, - x + y)}

o6 : List

i7 : J == P_0

o7 = true

i8 : R = ZZ[x,y,z,a,b,c]

o8 = R

o8 : PolynomialRing

i9 : I = ideal(27,x^2+1)

                 2
o9 = ideal (27, x  + 1)

o9 : Ideal of R

i10 : J = getMaxIdeal(I,{x,y,z})

                    2
o10 = ideal (z, y, x  + 1, 3)

o10 : Ideal of R

i11 : isSubset(I,J)

o11 = true

i12 : 
