-- -*- M2-comint -*- hash: 257259233

i1 : R = QQ[x,y,z]

o1 = R

o1 : PolynomialRing

i2 : P = matrix{{x^2*y+1,x+y-2,2*x*y}}

o2 = | x2y+1 x+y-2 2xy |

             1       3
o2 : Matrix R  <--- R

i3 : isProjective ker P

o3 = true

i4 : M = matrix{{-y,-z^2,0},{x,0,-z^2},{0,x^2,x*y}}

o4 = | -y -z2 0   |
     | x  0   -z2 |
     | 0  x2  xy  |

             3       3
o4 : Matrix R  <--- R

i5 : isProjective cokernel M

o5 = false

i6 : I = ideal(x^2,x*y,z^2)

             2        2
o6 = ideal (x , x*y, z )

o6 : Ideal of R

i7 : isProjective module I

o7 = false

i8 : isProjective R^3

o8 = true

i9 : isProjective module ideal x

o9 = true

i10 : 
